package com.mihail.suppubot.bot.commands.commandTypes;

import lombok.Getter;
import lombok.RequiredArgsConstructor;

import java.util.Arrays;
import java.util.Optional;

@Getter
@RequiredArgsConstructor
public enum IncidentCommandType {

    INCIDENT_1(
            "Ноутбук залили рідиною",
            """
                    💻 Ці дії збільшать шанси на збереження ноутбука 💻
                    
                    ✅ 1. Вимкнути ноутбук від зарядного пристрою. Максимально швидко.
                                        
                    ✅ 2. Вимкнути живлення ноутбука.
                    Якщо акумулятор виймається, зробіть це негайно. Якщо ж він не виймається, то натисніть кнопку живлення. Твердо та рішуче затисніть пальцем кнопку живлення та чекайте кілька секунд, доки екран не згасне.
                                        
                    ✅ 3. Висушити.
                    Якщо в корпус потрапила чиста вода в невеликій кількості, достатньо протерти клавіатуру серветкою або рушником, а потім повністю розкрити, покласти екраном вниз, і чекати.
                    У випадку з агресивною рідиною: солодкою кавою, чаєм чи алкоголем — щогодини все менше шансів на успішний ремонт без повної заміни материнської плати ноутбука. Якщо це ваш випадок відразу переходите до наступного кроку
                                        
                    ✅ 5. Віднести до сервіс-центру. 
                    Можливо, ремонт не потрібно, але розкрити ноутбук і перевірити, що волога та сліди корозії відсутні, необхідно.
                         
                                        
                    ‼️ Що не можна робити із залитим ноутбуком ‼️
                                        
                    ❌ Вмикати.
                    У жодному разі не намагайтеся увімкнути ноутбук, поки його не перевірили фахівці сервіс-центру.
                    Зрозуміло, як розмірковує звичайний користувач: якщо увімкнутися — добре, а якщо ні, треба просто ще трохи почекати. Насправді це може завдати непоправної шкоди мікросхем ноутбука.
                                        
                    ❌ Сушити феном і класти на гарячу батарею
                    Логіка підказує, що нагріта рідина швидше випарується, але реальний сценарій виглядає так: волога справді перетворюється на пару, а сам ноутбук — на лазню. Ви знімаєте ноутбук з батареї, він охолоджується та волога конденсується на кожному чіпі, на кожній доріжці.
                    """
    ),
    INCIDENT_2(
            "Телефон впав у воду",
            """
                    📱 Якщо ви втопили телефон, то головне виконати дві основні дії 📱
                   
                    1. Вийняти акумулятор
                    2. Якнайшвидше нести телефон у сервіс-центр
                                       
                    Якщо немає можливості одразу віднести телефон до сервісу, ці дії допоможуть збільшити життєздатність вашого телефону.
                                        
                    ✅ 1.Вимкніть пристрій та вийміть батарею.
                    У сучасних моделях акумулятори незнімні, без допомоги сервісу ви з ними не впораєтеся, тому переходимо до наступних кроків.
                                        
                    ✅ 2. Вийміть SIM-картку та картку пам'яті
                    Залишіть їх на добу для просушування. Можна протерти їх спиртом, щоб уникнути окислення.
                                        
                    ✅ 3. Заберіть воду
                    Промокніть сухою серветкою мокрі частини телефону. Покладіть пристрій та акумулятор у ємність із сирим рисом і залиште їх там на дві-три доби.
                                   
                                        
                    ‼️ Що не можна робити із телефоном ‼️
                                        
                    ❌ Не намагайтеся увімкнути телефон або поставити його на зарядку
                    Вода є провідником струму, тому може призвести до короткого замикання. Також під впливом струму значно прискорюється корозія електросхем.
                                        
                    ❌ Не розбирайте телефон, якщо ви не знаєте, як це робиться
                    Своїм втручанням у пристрій апарату можна завдати більше шкоди, адже всі деталі тонкі та тендітні.
                                        
                    ❌ Не сушіть телефон феном та не нагрівайте
                    Компоненти пристрою мають різний поріг допустимих температур. При сушінні феном телефон може пошкодитися через перегрівання.
                                        
                    ❌ Не трясіть телефон, щоб позбавитися води
                    Тряска тільки допоможе воді поширитися на пристрої.
                    """
    ),
    INCIDENT_3(
            "У середині ноутбука чутно, що щось клацає",
            """
                    При включенні ноутбука можна почути клацання, спалахують лампочки, вентилятор починає крутитися, але на екрані при цьому нічого не відображається і сам пристрій не працює.
                                        
                    Найчастіше причиною цього є поломка одного з елементів системної плати ноутбука. Винуватцем може бути як чіп відеокарти, так і маленький транзистор.
                                        
                    У такій ситуації ноутбук полагодити зможуть тільки інженери, оскільки визначити несправність в домашніх умовах не вдасться.
                    """
    ),
    INCIDENT_4(
            "Прилад Apple заблокували шахраї, і потребують грошей",
            """
                    Найголовніше – ніколи не платіть гроші шахраям. Заплативши, ви спровокуєте нові шахрайства.
                                        
                    Порядок дій:
                                        
                    1. Відновити доступ до електронної пошти. Зазвичай це робиться через службу підтримки вашого поштового сервісу.
                                        
                    2. Намагатися відновити свій пароль до Apple ID через сервіс «Мій Apple ID»
                                        
                    3. Зателефонувати до служби підтримки Apple
                    Підготуйте заздалегідь сам девайс. Випишіть його серійний номер або IMEI, оригінальний провід, чек про покупку пристрою, коробку.
                                        
                    4. Якщо шахраї перейменували ваш Apple ID, оператору потрібно буде знайти ваш обліковий запис. Вам поставлять три контрольні питання (ви відповідали на них, коли ви заводили обліковий запис), і бажано відповісти правильно хоча б на одне з них. Ще у вас запитають дату народження та номер картки, яка прив'язана до сервісів Apple. Якщо хоча б частина ваших відповідей збіглася, то обліковий запис знайдуть, операції по карті зупинять і прив'яжуть до запису колишню поштову скриньку. Під час бесіди рекомендується не нервувати та відповідати на запитання без зайвих коментарів.
                                        
                    7. Відновити дані через "Мій Apple ID".
                    Швидше за все, дані знищили, тому корисно мати копію девайсу на iCloud або ноутбук.
                                        
                    8. Написати заяву до поліції.
                    Шансів на упіймання шахраїв мало, але рано чи пізно вони помиляться, залишать сліди та їх зможуть упіймати. Тоді ваша заява допоможе притягти здирників до відповідальності.
                                        
                    Як захиститися від подібного шахрайства:
                                        
                    1. Прив'язати Apple ID до добре захищеного та не «засвіченого» ящика.
                                        
                    2. Увімкнути на iCloud подвійну верифікацію.
                    """
    );

    private final String name;
    private final String answer;

    public static Optional<IncidentCommandType> parse(String name) {
        return Arrays.stream(values())
                .filter(b -> b.name().equalsIgnoreCase(name) || b.name.equalsIgnoreCase(name))
                .findFirst();
    }

}
